{"config": [{"config": {"activation": "linear", "W_regularizer": null, "W_constraint": null, "b_regularizer": null, "batch_input_shape": [null, 3, 110, 110], "init": "glorot_uniform", "subsample": [1, 1], "dim_ordering": "th", "bias": true, "name": "convolution2d_1", "input_dtype": "float32", "b_constraint": null, "nb_filter": 32, "nb_row": 3, "activity_regularizer": null, "nb_col": 3, "trainable": true, "border_mode": "valid"}, "class_name": "Convolution2D"}, {"config": {"activation": "linear", "W_regularizer": null, "b_regularizer": null, "init": "glorot_uniform", "subsample": [1, 1], "W_constraint": null, "bias": true, "name": "convolution2d_2", "dim_ordering": "th", "b_constraint": null, "nb_filter": 64, "nb_row": 3, "activity_regularizer": null, "nb_col": 3, "trainable": true, "border_mode": "valid"}, "class_name": "Convolution2D"}, {"config": {"name": "activation_1", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"name": "maxpooling2d_1", "trainable": true, "dim_ordering": "th", "strides": [2, 2], "pool_size": [2, 2], "border_mode": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"activation": "linear", "W_regularizer": null, "b_regularizer": null, "init": "glorot_uniform", "subsample": [1, 1], "W_constraint": null, "bias": true, "name": "convolution2d_3", "dim_ordering": "th", "b_constraint": null, "nb_filter": 64, "nb_row": 3, "activity_regularizer": null, "nb_col": 3, "trainable": true, "border_mode": "valid"}, "class_name": "Convolution2D"}, {"config": {"activation": "linear", "W_regularizer": null, "b_regularizer": null, "init": "glorot_uniform", "subsample": [1, 1], "W_constraint": null, "bias": true, "name": "convolution2d_4", "dim_ordering": "th", "b_constraint": null, "nb_filter": 128, "nb_row": 3, "activity_regularizer": null, "nb_col": 3, "trainable": true, "border_mode": "valid"}, "class_name": "Convolution2D"}, {"config": {"name": "activation_2", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"name": "maxpooling2d_2", "trainable": true, "dim_ordering": "th", "strides": [2, 2], "pool_size": [2, 2], "border_mode": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"activation": "linear", "W_regularizer": null, "b_regularizer": null, "init": "glorot_uniform", "subsample": [1, 1], "W_constraint": null, "bias": true, "name": "convolution2d_5", "dim_ordering": "th", "b_constraint": null, "nb_filter": 96, "nb_row": 3, "activity_regularizer": null, "nb_col": 3, "trainable": true, "border_mode": "valid"}, "class_name": "Convolution2D"}, {"config": {"activation": "linear", "W_regularizer": null, "b_regularizer": null, "init": "glorot_uniform", "subsample": [1, 1], "W_constraint": null, "bias": true, "name": "convolution2d_6", "dim_ordering": "th", "b_constraint": null, "nb_filter": 192, "nb_row": 3, "activity_regularizer": null, "nb_col": 3, "trainable": true, "border_mode": "valid"}, "class_name": "Convolution2D"}, {"config": {"name": "activation_3", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"name": "maxpooling2d_3", "trainable": true, "dim_ordering": "th", "strides": [2, 2], "pool_size": [2, 2], "border_mode": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"activation": "linear", "W_regularizer": null, "b_regularizer": null, "init": "glorot_uniform", "subsample": [1, 1], "W_constraint": null, "bias": true, "name": "convolution2d_7", "dim_ordering": "th", "b_constraint": null, "nb_filter": 128, "nb_row": 3, "activity_regularizer": null, "nb_col": 3, "trainable": true, "border_mode": "valid"}, "class_name": "Convolution2D"}, {"config": {"activation": "linear", "W_regularizer": null, "b_regularizer": null, "init": "glorot_uniform", "subsample": [1, 1], "W_constraint": null, "bias": true, "name": "convolution2d_8", "dim_ordering": "th", "b_constraint": null, "nb_filter": 256, "nb_row": 3, "activity_regularizer": null, "nb_col": 3, "trainable": true, "border_mode": "valid"}, "class_name": "Convolution2D"}, {"config": {"name": "activation_4", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"name": "maxpooling2d_4", "trainable": true, "dim_ordering": "th", "strides": [2, 2], "pool_size": [2, 2], "border_mode": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_1", "trainable": true, "p": 0.2}, "class_name": "Dropout"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"activation": "linear", "input_dim": 2304, "b_regularizer": null, "W_regularizer": null, "init": "glorot_uniform", "W_constraint": null, "bias": true, "name": "dense_1", "output_dim": 20, "b_constraint": null, "activity_regularizer": null, "trainable": true}, "class_name": "Dense"}, {"config": {"name": "activation_5", "activation": "softmax", "trainable": true}, "class_name": "Activation"}], "class_name": "Sequential", "keras_version": "1.2.2"}