{
	"keras_version": "1.2.2",
	"config": [{
		"config": {
			"input_dtype": "float32",
			"activity_regularizer": null,
			"nb_filter": 32,
			"nb_col": 3,
			"subsample": [1, 1],
			"bias": true,
			"b_regularizer": null,
			"trainable": true,
			"border_mode": "valid",
			"W_regularizer": null,
			"b_constraint": null,
			"activation": "linear",
			"W_constraint": null,
			"nb_row": 3,
			"init": "glorot_uniform",
			"name": "convolution2d_1",
			"batch_input_shape": [null, 3, 110, 110],
			"dim_ordering": "th"
		},
		"class_name": "Convolution2D"
	}, {
		"config": {
			"subsample": [1, 1],
			"activity_regularizer": null,
			"nb_filter": 64,
			"nb_col": 3,
			"trainable": true,
			"bias": true,
			"b_regularizer": null,
			"b_constraint": null,
			"W_regularizer": null,
			"name": "convolution2d_2",
			"activation": "linear",
			"W_constraint": null,
			"nb_row": 3,
			"init": "glorot_uniform",
			"border_mode": "valid",
			"dim_ordering": "th"
		},
		"class_name": "Convolution2D"
	}, {
		"config": {
			"name": "activation_1",
			"activation": "relu",
			"trainable": true
		},
		"class_name": "Activation"
	}, {
		"config": {
			"pool_size": [2, 2],
			"strides": [2, 2],
			"name": "maxpooling2d_1",
			"trainable": true,
			"dim_ordering": "th",
			"border_mode": "valid"
		},
		"class_name": "MaxPooling2D"
	}, {
		"config": {
			"subsample": [1, 1],
			"activity_regularizer": null,
			"nb_filter": 64,
			"nb_col": 3,
			"trainable": true,
			"bias": true,
			"b_regularizer": null,
			"b_constraint": null,
			"W_regularizer": null,
			"name": "convolution2d_3",
			"activation": "linear",
			"W_constraint": null,
			"nb_row": 3,
			"init": "glorot_uniform",
			"border_mode": "valid",
			"dim_ordering": "th"
		},
		"class_name": "Convolution2D"
	}, {
		"config": {
			"subsample": [1, 1],
			"activity_regularizer": null,
			"nb_filter": 128,
			"nb_col": 3,
			"trainable": true,
			"bias": true,
			"b_regularizer": null,
			"b_constraint": null,
			"W_regularizer": null,
			"name": "convolution2d_4",
			"activation": "linear",
			"W_constraint": null,
			"nb_row": 3,
			"init": "glorot_uniform",
			"border_mode": "valid",
			"dim_ordering": "th"
		},
		"class_name": "Convolution2D"
	}, {
		"config": {
			"name": "activation_2",
			"activation": "relu",
			"trainable": true
		},
		"class_name": "Activation"
	}, {
		"config": {
			"pool_size": [2, 2],
			"strides": [2, 2],
			"name": "maxpooling2d_2",
			"trainable": true,
			"dim_ordering": "th",
			"border_mode": "valid"
		},
		"class_name": "MaxPooling2D"
	}, {
		"config": {
			"subsample": [1, 1],
			"activity_regularizer": null,
			"nb_filter": 96,
			"nb_col": 3,
			"trainable": true,
			"bias": true,
			"b_regularizer": null,
			"b_constraint": null,
			"W_regularizer": null,
			"name": "convolution2d_5",
			"activation": "linear",
			"W_constraint": null,
			"nb_row": 3,
			"init": "glorot_uniform",
			"border_mode": "valid",
			"dim_ordering": "th"
		},
		"class_name": "Convolution2D"
	}, {
		"config": {
			"subsample": [1, 1],
			"activity_regularizer": null,
			"nb_filter": 192,
			"nb_col": 3,
			"trainable": true,
			"bias": true,
			"b_regularizer": null,
			"b_constraint": null,
			"W_regularizer": null,
			"name": "convolution2d_6",
			"activation": "linear",
			"W_constraint": null,
			"nb_row": 3,
			"init": "glorot_uniform",
			"border_mode": "valid",
			"dim_ordering": "th"
		},
		"class_name": "Convolution2D"
	}, {
		"config": {
			"name": "activation_3",
			"activation": "relu",
			"trainable": true
		},
		"class_name": "Activation"
	}, {
		"config": {
			"pool_size": [2, 2],
			"strides": [2, 2],
			"name": "maxpooling2d_3",
			"trainable": true,
			"dim_ordering": "th",
			"border_mode": "valid"
		},
		"class_name": "MaxPooling2D"
	}, {
		"config": {
			"subsample": [1, 1],
			"activity_regularizer": null,
			"nb_filter": 128,
			"nb_col": 3,
			"trainable": true,
			"bias": true,
			"b_regularizer": null,
			"b_constraint": null,
			"W_regularizer": null,
			"name": "convolution2d_7",
			"activation": "linear",
			"W_constraint": null,
			"nb_row": 3,
			"init": "glorot_uniform",
			"border_mode": "valid",
			"dim_ordering": "th"
		},
		"class_name": "Convolution2D"
	}, {
		"config": {
			"subsample": [1, 1],
			"activity_regularizer": null,
			"nb_filter": 256,
			"nb_col": 3,
			"trainable": true,
			"bias": true,
			"b_regularizer": null,
			"b_constraint": null,
			"W_regularizer": null,
			"name": "convolution2d_8",
			"activation": "linear",
			"W_constraint": null,
			"nb_row": 3,
			"init": "glorot_uniform",
			"border_mode": "valid",
			"dim_ordering": "th"
		},
		"class_name": "Convolution2D"
	}, {
		"config": {
			"name": "activation_4",
			"activation": "relu",
			"trainable": true
		},
		"class_name": "Activation"
	}, {
		"config": {
			"pool_size": [2, 2],
			"strides": [2, 2],
			"name": "maxpooling2d_4",
			"trainable": true,
			"dim_ordering": "th",
			"border_mode": "valid"
		},
		"class_name": "MaxPooling2D"
	}, {
		"config": {
			"name": "dropout_1",
			"p": 0.4,
			"trainable": true
		},
		"class_name": "Dropout"
	}, {
		"config": {
			"name": "flatten_1",
			"trainable": true
		},
		"class_name": "Flatten"
	}, {
		"config": {
			"W_regularizer": null,
			"input_dim": 2304,
			"activity_regularizer": null,
			"trainable": true,
			"bias": true,
			"b_regularizer": null,
			"output_dim": 4,
			"b_constraint": null,
			"name": "dense_1",
			"activation": "linear",
			"W_constraint": null,
			"init": "glorot_uniform"
		},
		"class_name": "Dense"
	}, {
		"config": {
			"name": "activation_5",
			"activation": "softmax",
			"trainable": true
		},
		"class_name": "Activation"
	}],
	"class_name": "Sequential"
}