{"class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"name": "convolution2d_1", "input_dtype": "float32", "activation": "linear", "b_constraint": null, "batch_input_shape": [null, 3, 110, 110], "nb_row": 3, "b_regularizer": null, "activity_regularizer": null, "dim_ordering": "th", "nb_filter": 32, "bias": true, "border_mode": "valid", "trainable": true, "init": "glorot_uniform", "W_regularizer": null, "subsample": [1, 1], "W_constraint": null, "nb_col": 3}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_2", "activation": "linear", "b_constraint": null, "nb_row": 3, "b_regularizer": null, "activity_regularizer": null, "dim_ordering": "th", "nb_filter": 64, "bias": true, "border_mode": "valid", "trainable": true, "init": "glorot_uniform", "W_regularizer": null, "subsample": [1, 1], "W_constraint": null, "nb_col": 3}}, {"class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_1", "pool_size": [2, 2], "strides": [2, 2], "border_mode": "valid", "trainable": true, "dim_ordering": "th"}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_3", "activation": "linear", "b_constraint": null, "nb_row": 3, "b_regularizer": null, "activity_regularizer": null, "dim_ordering": "th", "nb_filter": 64, "bias": true, "border_mode": "valid", "trainable": true, "init": "glorot_uniform", "W_regularizer": null, "subsample": [1, 1], "W_constraint": null, "nb_col": 3}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_4", "activation": "linear", "b_constraint": null, "nb_row": 3, "b_regularizer": null, "activity_regularizer": null, "dim_ordering": "th", "nb_filter": 128, "bias": true, "border_mode": "valid", "trainable": true, "init": "glorot_uniform", "W_regularizer": null, "subsample": [1, 1], "W_constraint": null, "nb_col": 3}}, {"class_name": "Activation", "config": {"name": "activation_2", "trainable": true, "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_2", "pool_size": [2, 2], "strides": [2, 2], "border_mode": "valid", "trainable": true, "dim_ordering": "th"}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_5", "activation": "linear", "b_constraint": null, "nb_row": 3, "b_regularizer": null, "activity_regularizer": null, "dim_ordering": "th", "nb_filter": 96, "bias": true, "border_mode": "valid", "trainable": true, "init": "glorot_uniform", "W_regularizer": null, "subsample": [1, 1], "W_constraint": null, "nb_col": 3}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_6", "activation": "linear", "b_constraint": null, "nb_row": 3, "b_regularizer": null, "activity_regularizer": null, "dim_ordering": "th", "nb_filter": 192, "bias": true, "border_mode": "valid", "trainable": true, "init": "glorot_uniform", "W_regularizer": null, "subsample": [1, 1], "W_constraint": null, "nb_col": 3}}, {"class_name": "Activation", "config": {"name": "activation_3", "trainable": true, "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_3", "pool_size": [2, 2], "strides": [2, 2], "border_mode": "valid", "trainable": true, "dim_ordering": "th"}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_7", "activation": "linear", "b_constraint": null, "nb_row": 3, "b_regularizer": null, "activity_regularizer": null, "dim_ordering": "th", "nb_filter": 128, "bias": true, "border_mode": "valid", "trainable": true, "init": "glorot_uniform", "W_regularizer": null, "subsample": [1, 1], "W_constraint": null, "nb_col": 3}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_8", "activation": "linear", "b_constraint": null, "nb_row": 3, "b_regularizer": null, "activity_regularizer": null, "dim_ordering": "th", "nb_filter": 256, "bias": true, "border_mode": "valid", "trainable": true, "init": "glorot_uniform", "W_regularizer": null, "subsample": [1, 1], "W_constraint": null, "nb_col": 3}}, {"class_name": "Activation", "config": {"name": "activation_4", "trainable": true, "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_4", "pool_size": [2, 2], "strides": [2, 2], "border_mode": "valid", "trainable": true, "dim_ordering": "th"}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "p": 0.2}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"name": "dense_1", "activation": "linear", "b_constraint": null, "b_regularizer": null, "output_dim": 100, "activity_regularizer": null, "bias": true, "trainable": true, "init": "glorot_uniform", "W_regularizer": null, "input_dim": 2304, "W_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_5", "trainable": true, "activation": "softmax"}}], "keras_version": "1.2.2"}