{"config": [{"config": {"nb_row": 3, "activation": "linear", "batch_input_shape": [null, 3, 110, 110], "name": "convolution2d_1", "subsample": [1, 1], "trainable": true, "W_constraint": null, "bias": true, "nb_col": 3, "W_regularizer": null, "init": "glorot_uniform", "input_dtype": "float32", "border_mode": "valid", "nb_filter": 32, "b_constraint": null, "activity_regularizer": null, "b_regularizer": null, "dim_ordering": "th"}, "class_name": "Convolution2D"}, {"config": {"nb_row": 3, "activation": "linear", "dim_ordering": "th", "name": "convolution2d_2", "subsample": [1, 1], "trainable": true, "W_constraint": null, "nb_col": 3, "W_regularizer": null, "init": "glorot_uniform", "bias": true, "border_mode": "valid", "nb_filter": 64, "b_constraint": null, "activity_regularizer": null, "b_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"name": "activation_1", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"name": "maxpooling2d_1", "dim_ordering": "th", "border_mode": "valid", "trainable": true, "pool_size": [2, 2], "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"nb_row": 3, "activation": "linear", "dim_ordering": "th", "name": "convolution2d_3", "subsample": [1, 1], "trainable": true, "W_constraint": null, "nb_col": 3, "W_regularizer": null, "init": "glorot_uniform", "bias": true, "border_mode": "valid", "nb_filter": 64, "b_constraint": null, "activity_regularizer": null, "b_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"nb_row": 3, "activation": "linear", "dim_ordering": "th", "name": "convolution2d_4", "subsample": [1, 1], "trainable": true, "W_constraint": null, "nb_col": 3, "W_regularizer": null, "init": "glorot_uniform", "bias": true, "border_mode": "valid", "nb_filter": 128, "b_constraint": null, "activity_regularizer": null, "b_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"name": "activation_2", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"name": "maxpooling2d_2", "dim_ordering": "th", "border_mode": "valid", "trainable": true, "pool_size": [2, 2], "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"nb_row": 3, "activation": "linear", "dim_ordering": "th", "name": "convolution2d_5", "subsample": [1, 1], "trainable": true, "W_constraint": null, "nb_col": 3, "W_regularizer": null, "init": "glorot_uniform", "bias": true, "border_mode": "valid", "nb_filter": 96, "b_constraint": null, "activity_regularizer": null, "b_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"nb_row": 3, "activation": "linear", "dim_ordering": "th", "name": "convolution2d_6", "subsample": [1, 1], "trainable": true, "W_constraint": null, "nb_col": 3, "W_regularizer": null, "init": "glorot_uniform", "bias": true, "border_mode": "valid", "nb_filter": 192, "b_constraint": null, "activity_regularizer": null, "b_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"name": "activation_3", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"name": "maxpooling2d_3", "dim_ordering": "th", "border_mode": "valid", "trainable": true, "pool_size": [2, 2], "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"nb_row": 3, "activation": "linear", "dim_ordering": "th", "name": "convolution2d_7", "subsample": [1, 1], "trainable": true, "W_constraint": null, "nb_col": 3, "W_regularizer": null, "init": "glorot_uniform", "bias": true, "border_mode": "valid", "nb_filter": 128, "b_constraint": null, "activity_regularizer": null, "b_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"nb_row": 3, "activation": "linear", "dim_ordering": "th", "name": "convolution2d_8", "subsample": [1, 1], "trainable": true, "W_constraint": null, "nb_col": 3, "W_regularizer": null, "init": "glorot_uniform", "bias": true, "border_mode": "valid", "nb_filter": 256, "b_constraint": null, "activity_regularizer": null, "b_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"name": "activation_4", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"name": "maxpooling2d_4", "dim_ordering": "th", "border_mode": "valid", "trainable": true, "pool_size": [2, 2], "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_1", "trainable": true, "p": 0.2}, "class_name": "Dropout"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"output_dim": 20, "input_dim": 2304, "trainable": true, "W_constraint": null, "name": "dense_1", "W_regularizer": null, "init": "glorot_uniform", "bias": true, "activation": "linear", "b_constraint": null, "activity_regularizer": null, "b_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "activation_5", "trainable": true, "activation": "softmax"}, "class_name": "Activation"}], "class_name": "Sequential", "keras_version": "1.2.2"}