{"backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.0.3", "config": [{"class_name": "Conv2D", "config": {"filters": 32, "padding": "valid", "activity_regularizer": null, "activation": "linear", "kernel_size": [3, 3], "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "kernel_regularizer": null, "batch_input_shape": [null, 110, 110, 3], "kernel_constraint": null, "strides": [1, 1], "bias_constraint": null, "dtype": "float32", "use_bias": true, "data_format": "channels_last", "name": "conv2d_1", "dilation_rate": [1, 1], "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Conv2D", "config": {"filters": 64, "padding": "valid", "activity_regularizer": null, "activation": "linear", "kernel_size": [3, 3], "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "kernel_regularizer": null, "kernel_constraint": null, "strides": [1, 1], "bias_constraint": null, "use_bias": true, "data_format": "channels_last", "name": "conv2d_2", "dilation_rate": [1, 1], "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_1", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "pool_size": [2, 2], "strides": [2, 2], "data_format": "channels_last", "name": "max_pooling2d_1", "trainable": true}}, {"class_name": "Conv2D", "config": {"filters": 64, "padding": "valid", "activity_regularizer": null, "activation": "linear", "kernel_size": [3, 3], "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "kernel_regularizer": null, "kernel_constraint": null, "strides": [1, 1], "bias_constraint": null, "use_bias": true, "data_format": "channels_last", "name": "conv2d_3", "dilation_rate": [1, 1], "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Conv2D", "config": {"filters": 128, "padding": "valid", "activity_regularizer": null, "activation": "linear", "kernel_size": [3, 3], "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "kernel_regularizer": null, "kernel_constraint": null, "strides": [1, 1], "bias_constraint": null, "use_bias": true, "data_format": "channels_last", "name": "conv2d_4", "dilation_rate": [1, 1], "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_2", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "pool_size": [2, 2], "strides": [2, 2], "data_format": "channels_last", "name": "max_pooling2d_2", "trainable": true}}, {"class_name": "Conv2D", "config": {"filters": 96, "padding": "valid", "activity_regularizer": null, "activation": "linear", "kernel_size": [3, 3], "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "kernel_regularizer": null, "kernel_constraint": null, "strides": [1, 1], "bias_constraint": null, "use_bias": true, "data_format": "channels_last", "name": "conv2d_5", "dilation_rate": [1, 1], "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Conv2D", "config": {"filters": 192, "padding": "valid", "activity_regularizer": null, "activation": "linear", "kernel_size": [3, 3], "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "kernel_regularizer": null, "kernel_constraint": null, "strides": [1, 1], "bias_constraint": null, "use_bias": true, "data_format": "channels_last", "name": "conv2d_6", "dilation_rate": [1, 1], "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_3", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "pool_size": [2, 2], "strides": [2, 2], "data_format": "channels_last", "name": "max_pooling2d_3", "trainable": true}}, {"class_name": "Conv2D", "config": {"filters": 128, "padding": "valid", "activity_regularizer": null, "activation": "linear", "kernel_size": [3, 3], "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "kernel_regularizer": null, "kernel_constraint": null, "strides": [1, 1], "bias_constraint": null, "use_bias": true, "data_format": "channels_last", "name": "conv2d_7", "dilation_rate": [1, 1], "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Conv2D", "config": {"filters": 256, "padding": "valid", "activity_regularizer": null, "activation": "linear", "kernel_size": [3, 3], "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "kernel_regularizer": null, "kernel_constraint": null, "strides": [1, 1], "bias_constraint": null, "use_bias": true, "data_format": "channels_last", "name": "conv2d_8", "dilation_rate": [1, 1], "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_4", "trainable": true}}, {"class_name": "AveragePooling2D", "config": {"padding": "valid", "pool_size": [2, 2], "strides": [2, 2], "data_format": "channels_last", "name": "average_pooling2d_1", "trainable": true}}, {"class_name": "Dropout", "config": {"rate": 0.2, "name": "dropout_1", "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"units": 225, "activity_regularizer": null, "activation": "linear", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "kernel_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "use_bias": true, "name": "dense_1", "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Activation", "config": {"activation": "softmax", "name": "activation_5", "trainable": true}}]}