{"keras_version": "1.2.2", "class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"activity_regularizer": null, "batch_input_shape": [null, 3, 110, 110], "input_dtype": "float32", "dim_ordering": "th", "nb_col": 3, "name": "convolution2d_1", "W_regularizer": null, "bias": true, "nb_filter": 32, "b_regularizer": null, "activation": "linear", "nb_row": 3, "W_constraint": null, "subsample": [1, 1], "trainable": true, "b_constraint": null, "init": "glorot_uniform", "border_mode": "valid"}}, {"class_name": "Convolution2D", "config": {"activity_regularizer": null, "dim_ordering": "th", "nb_col": 3, "bias": true, "trainable": true, "name": "convolution2d_2", "nb_filter": 64, "W_regularizer": null, "b_regularizer": null, "activation": "linear", "nb_row": 3, "W_constraint": null, "subsample": [1, 1], "b_constraint": null, "init": "glorot_uniform", "border_mode": "valid"}}, {"class_name": "Activation", "config": {"name": "activation_1", "activation": "relu", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "dim_ordering": "th", "pool_size": [2, 2], "trainable": true, "name": "maxpooling2d_1", "border_mode": "valid"}}, {"class_name": "Convolution2D", "config": {"activity_regularizer": null, "dim_ordering": "th", "nb_col": 3, "bias": true, "trainable": true, "name": "convolution2d_3", "nb_filter": 64, "W_regularizer": null, "b_regularizer": null, "activation": "linear", "nb_row": 3, "W_constraint": null, "subsample": [1, 1], "b_constraint": null, "init": "glorot_uniform", "border_mode": "valid"}}, {"class_name": "Convolution2D", "config": {"activity_regularizer": null, "dim_ordering": "th", "nb_col": 3, "bias": true, "trainable": true, "name": "convolution2d_4", "nb_filter": 128, "W_regularizer": null, "b_regularizer": null, "activation": "linear", "nb_row": 3, "W_constraint": null, "subsample": [1, 1], "b_constraint": null, "init": "glorot_uniform", "border_mode": "valid"}}, {"class_name": "Activation", "config": {"name": "activation_2", "activation": "relu", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "dim_ordering": "th", "pool_size": [2, 2], "trainable": true, "name": "maxpooling2d_2", "border_mode": "valid"}}, {"class_name": "Convolution2D", "config": {"activity_regularizer": null, "dim_ordering": "th", "nb_col": 3, "bias": true, "trainable": true, "name": "convolution2d_5", "nb_filter": 96, "W_regularizer": null, "b_regularizer": null, "activation": "linear", "nb_row": 3, "W_constraint": null, "subsample": [1, 1], "b_constraint": null, "init": "glorot_uniform", "border_mode": "valid"}}, {"class_name": "Convolution2D", "config": {"activity_regularizer": null, "dim_ordering": "th", "nb_col": 3, "bias": true, "trainable": true, "name": "convolution2d_6", "nb_filter": 192, "W_regularizer": null, "b_regularizer": null, "activation": "linear", "nb_row": 3, "W_constraint": null, "subsample": [1, 1], "b_constraint": null, "init": "glorot_uniform", "border_mode": "valid"}}, {"class_name": "Activation", "config": {"name": "activation_3", "activation": "relu", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "dim_ordering": "th", "pool_size": [2, 2], "trainable": true, "name": "maxpooling2d_3", "border_mode": "valid"}}, {"class_name": "Convolution2D", "config": {"activity_regularizer": null, "dim_ordering": "th", "nb_col": 3, "bias": true, "trainable": true, "name": "convolution2d_7", "nb_filter": 128, "W_regularizer": null, "b_regularizer": null, "activation": "linear", "nb_row": 3, "W_constraint": null, "subsample": [1, 1], "b_constraint": null, "init": "glorot_uniform", "border_mode": "valid"}}, {"class_name": "Convolution2D", "config": {"activity_regularizer": null, "dim_ordering": "th", "nb_col": 3, "bias": true, "trainable": true, "name": "convolution2d_8", "nb_filter": 256, "W_regularizer": null, "b_regularizer": null, "activation": "linear", "nb_row": 3, "W_constraint": null, "subsample": [1, 1], "b_constraint": null, "init": "glorot_uniform", "border_mode": "valid"}}, {"class_name": "Activation", "config": {"name": "activation_4", "activation": "relu", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "dim_ordering": "th", "pool_size": [2, 2], "trainable": true, "name": "maxpooling2d_4", "border_mode": "valid"}}, {"class_name": "Dropout", "config": {"p": 0.2, "name": "dropout_1", "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"b_regularizer": null, "output_dim": 10575, "name": "dense_1", "W_regularizer": null, "b_constraint": null, "activity_regularizer": null, "input_dim": 2304, "activation": "linear", "trainable": true, "W_constraint": null, "init": "glorot_uniform", "bias": true}}, {"class_name": "Activation", "config": {"name": "activation_5", "activation": "softmax", "trainable": true}}]}