{"class_name": "Sequential", "keras_version": "1.2.2", "config": [{"class_name": "Convolution2D", "config": {"init": "glorot_uniform", "input_dtype": "float32", "b_regularizer": null, "nb_filter": 32, "b_constraint": null, "activity_regularizer": null, "border_mode": "valid", "subsample": [1, 1], "W_regularizer": null, "dim_ordering": "tf", "nb_row": 3, "trainable": true, "W_constraint": null, "activation": "linear", "batch_input_shape": [null, 110, 110, 3], "name": "convolution2d_1", "bias": true, "nb_col": 3}}, {"class_name": "Convolution2D", "config": {"init": "glorot_uniform", "b_regularizer": null, "dim_ordering": "tf", "b_constraint": null, "activity_regularizer": null, "border_mode": "valid", "subsample": [1, 1], "W_regularizer": null, "nb_filter": 64, "nb_row": 3, "trainable": true, "W_constraint": null, "activation": "linear", "name": "convolution2d_2", "bias": true, "nb_col": 3}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_1", "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "trainable": true, "dim_ordering": "tf", "name": "maxpooling2d_1", "border_mode": "valid", "pool_size": [2, 2]}}, {"class_name": "Convolution2D", "config": {"init": "glorot_uniform", "b_regularizer": null, "dim_ordering": "tf", "b_constraint": null, "activity_regularizer": null, "border_mode": "valid", "subsample": [1, 1], "W_regularizer": null, "nb_filter": 64, "nb_row": 3, "trainable": true, "W_constraint": null, "activation": "linear", "name": "convolution2d_3", "bias": true, "nb_col": 3}}, {"class_name": "Convolution2D", "config": {"init": "glorot_uniform", "b_regularizer": null, "dim_ordering": "tf", "b_constraint": null, "activity_regularizer": null, "border_mode": "valid", "subsample": [1, 1], "W_regularizer": null, "nb_filter": 128, "nb_row": 3, "trainable": true, "W_constraint": null, "activation": "linear", "name": "convolution2d_4", "bias": true, "nb_col": 3}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_2", "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "trainable": true, "dim_ordering": "tf", "name": "maxpooling2d_2", "border_mode": "valid", "pool_size": [2, 2]}}, {"class_name": "Convolution2D", "config": {"init": "glorot_uniform", "b_regularizer": null, "dim_ordering": "tf", "b_constraint": null, "activity_regularizer": null, "border_mode": "valid", "subsample": [1, 1], "W_regularizer": null, "nb_filter": 96, "nb_row": 3, "trainable": true, "W_constraint": null, "activation": "linear", "name": "convolution2d_5", "bias": true, "nb_col": 3}}, {"class_name": "Convolution2D", "config": {"init": "glorot_uniform", "b_regularizer": null, "dim_ordering": "tf", "b_constraint": null, "activity_regularizer": null, "border_mode": "valid", "subsample": [1, 1], "W_regularizer": null, "nb_filter": 192, "nb_row": 3, "trainable": true, "W_constraint": null, "activation": "linear", "name": "convolution2d_6", "bias": true, "nb_col": 3}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_3", "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "trainable": true, "dim_ordering": "tf", "name": "maxpooling2d_3", "border_mode": "valid", "pool_size": [2, 2]}}, {"class_name": "Convolution2D", "config": {"init": "glorot_uniform", "b_regularizer": null, "dim_ordering": "tf", "b_constraint": null, "activity_regularizer": null, "border_mode": "valid", "subsample": [1, 1], "W_regularizer": null, "nb_filter": 128, "nb_row": 3, "trainable": true, "W_constraint": null, "activation": "linear", "name": "convolution2d_7", "bias": true, "nb_col": 3}}, {"class_name": "Convolution2D", "config": {"init": "glorot_uniform", "b_regularizer": null, "dim_ordering": "tf", "b_constraint": null, "activity_regularizer": null, "border_mode": "valid", "subsample": [1, 1], "W_regularizer": null, "nb_filter": 256, "nb_row": 3, "trainable": true, "W_constraint": null, "activation": "linear", "name": "convolution2d_8", "bias": true, "nb_col": 3}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_4", "activation": "relu"}}, {"class_name": "Convolution2D", "config": {"init": "glorot_uniform", "b_regularizer": null, "dim_ordering": "tf", "b_constraint": null, "activity_regularizer": null, "border_mode": "valid", "subsample": [1, 1], "W_regularizer": null, "nb_filter": 160, "nb_row": 3, "trainable": true, "W_constraint": null, "activation": "linear", "name": "convolution2d_9", "bias": true, "nb_col": 3}}, {"class_name": "Convolution2D", "config": {"init": "glorot_uniform", "b_regularizer": null, "dim_ordering": "tf", "b_constraint": null, "activity_regularizer": null, "border_mode": "valid", "subsample": [1, 1], "W_regularizer": null, "nb_filter": 320, "nb_row": 3, "trainable": true, "W_constraint": null, "activation": "linear", "name": "convolution2d_10", "bias": true, "nb_col": 3}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_5", "activation": "relu"}}, {"class_name": "AveragePooling2D", "config": {"strides": [2, 2], "trainable": true, "dim_ordering": "tf", "name": "averagepooling2d_1", "border_mode": "valid", "pool_size": [2, 2]}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.2, "name": "dropout_1"}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"input_dim": 320, "b_regularizer": null, "output_dim": 575, "b_constraint": null, "activity_regularizer": null, "init": "glorot_uniform", "W_regularizer": null, "trainable": true, "W_constraint": null, "activation": "linear", "name": "dense_1", "bias": true}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_6", "activation": "softmax"}}]}