_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_1 (Conv2D)            (None, 32, 108, 108)      896       
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 64, 106, 106)      18496     
_________________________________________________________________
activation_1 (Activation)    (None, 64, 106, 106)      0         
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 64, 53, 53)        0         
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 64, 51, 51)        36928     
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 128, 49, 49)       73856     
_________________________________________________________________
activation_2 (Activation)    (None, 128, 49, 49)       0         
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 128, 24, 24)       0         
_________________________________________________________________
conv2d_5 (Conv2D)            (None, 96, 22, 22)        110688    
_________________________________________________________________
conv2d_6 (Conv2D)            (None, 192, 20, 20)       166080    
_________________________________________________________________
activation_3 (Activation)    (None, 192, 20, 20)       0         
_________________________________________________________________
max_pooling2d_3 (MaxPooling2 (None, 192, 10, 10)       0         
_________________________________________________________________
conv2d_7 (Conv2D)            (None, 128, 8, 8)         221312    
_________________________________________________________________
conv2d_8 (Conv2D)            (None, 256, 6, 6)         295168    
_________________________________________________________________
activation_4 (Activation)    (None, 256, 6, 6)         0         
_________________________________________________________________
average_pooling2d_1 (Average (None, 256, 3, 3)         0         
_________________________________________________________________
dropout_1 (Dropout)          (None, 256, 3, 3)         0         
_________________________________________________________________
flatten_1 (Flatten)          (None, 2304)              0         
_________________________________________________________________
dense_1 (Dense)              (None, 10575)             24375375  
_________________________________________________________________
activation_5 (Activation)    (None, 10575)             0         
=================================================================
Total params: 25,298,799
Trainable params: 25,298,799
Non-trainable params: 0
_________________________________________________________________
None
2017-04-15 21:57:02
Total execution time: 4.604 s