____________________________________________________________________________________________________
Layer (type)                     Output Shape          Param #     Connected to                     
====================================================================================================
input_1 (InputLayer)             (None, 224, 224, 3)   0                                            
____________________________________________________________________________________________________
zero_padding2d_1 (ZeroPadding2D) (None, 230, 230, 3)   0                                            
____________________________________________________________________________________________________
conv1 (Conv2D)                   (None, 112, 112, 64)  9472                                         
____________________________________________________________________________________________________
bn_conv1 (BatchNormalization)    (None, 112, 112, 64)  256                                          
____________________________________________________________________________________________________
activation_1 (Activation)        (None, 112, 112, 64)  0                                            
____________________________________________________________________________________________________
max_pooling2d_1 (MaxPooling2D)   (None, 55, 55, 64)    0                                            
____________________________________________________________________________________________________
res2a_branch2a (Conv2D)          (None, 55, 55, 64)    4160                                         
____________________________________________________________________________________________________
bn2a_branch2a (BatchNormalizatio (None, 55, 55, 64)    256                                          
____________________________________________________________________________________________________
activation_2 (Activation)        (None, 55, 55, 64)    0                                            
____________________________________________________________________________________________________
res2a_branch2b (Conv2D)          (None, 55, 55, 64)    36928                                        
____________________________________________________________________________________________________
bn2a_branch2b (BatchNormalizatio (None, 55, 55, 64)    256                                          
____________________________________________________________________________________________________
activation_3 (Activation)        (None, 55, 55, 64)    0                                            
____________________________________________________________________________________________________
res2a_branch2c (Conv2D)          (None, 55, 55, 256)   16640                                        
____________________________________________________________________________________________________
res2a_branch1 (Conv2D)           (None, 55, 55, 256)   16640                                        
____________________________________________________________________________________________________
bn2a_branch2c (BatchNormalizatio (None, 55, 55, 256)   1024                                         
____________________________________________________________________________________________________
bn2a_branch1 (BatchNormalization (None, 55, 55, 256)   1024                                         
____________________________________________________________________________________________________
add_1 (Add)                      (None, 55, 55, 256)   0                                            
____________________________________________________________________________________________________
activation_4 (Activation)        (None, 55, 55, 256)   0                                            
____________________________________________________________________________________________________
res2b_branch2a (Conv2D)          (None, 55, 55, 64)    16448                                        
____________________________________________________________________________________________________
bn2b_branch2a (BatchNormalizatio (None, 55, 55, 64)    256                                          
____________________________________________________________________________________________________
activation_5 (Activation)        (None, 55, 55, 64)    0                                            
____________________________________________________________________________________________________
res2b_branch2b (Conv2D)          (None, 55, 55, 64)    36928                                        
____________________________________________________________________________________________________
bn2b_branch2b (BatchNormalizatio (None, 55, 55, 64)    256                                          
____________________________________________________________________________________________________
activation_6 (Activation)        (None, 55, 55, 64)    0                                            
____________________________________________________________________________________________________
res2b_branch2c (Conv2D)          (None, 55, 55, 256)   16640                                        
____________________________________________________________________________________________________
bn2b_branch2c (BatchNormalizatio (None, 55, 55, 256)   1024                                         
____________________________________________________________________________________________________
add_2 (Add)                      (None, 55, 55, 256)   0                                            
____________________________________________________________________________________________________
activation_7 (Activation)        (None, 55, 55, 256)   0                                            
____________________________________________________________________________________________________
res2c_branch2a (Conv2D)          (None, 55, 55, 64)    16448                                        
____________________________________________________________________________________________________
bn2c_branch2a (BatchNormalizatio (None, 55, 55, 64)    256                                          
____________________________________________________________________________________________________
activation_8 (Activation)        (None, 55, 55, 64)    0                                            
____________________________________________________________________________________________________
res2c_branch2b (Conv2D)          (None, 55, 55, 64)    36928                                        
____________________________________________________________________________________________________
bn2c_branch2b (BatchNormalizatio (None, 55, 55, 64)    256                                          
____________________________________________________________________________________________________
activation_9 (Activation)        (None, 55, 55, 64)    0                                            
____________________________________________________________________________________________________
res2c_branch2c (Conv2D)          (None, 55, 55, 256)   16640                                        
____________________________________________________________________________________________________
bn2c_branch2c (BatchNormalizatio (None, 55, 55, 256)   1024                                         
____________________________________________________________________________________________________
add_3 (Add)                      (None, 55, 55, 256)   0                                            
____________________________________________________________________________________________________
activation_10 (Activation)       (None, 55, 55, 256)   0                                            
____________________________________________________________________________________________________
res3a_branch2a (Conv2D)          (None, 28, 28, 128)   32896                                        
____________________________________________________________________________________________________
bn3a_branch2a (BatchNormalizatio (None, 28, 28, 128)   512                                          
____________________________________________________________________________________________________
activation_11 (Activation)       (None, 28, 28, 128)   0                                            
____________________________________________________________________________________________________
res3a_branch2b (Conv2D)          (None, 28, 28, 128)   147584                                       
____________________________________________________________________________________________________
bn3a_branch2b (BatchNormalizatio (None, 28, 28, 128)   512                                          
____________________________________________________________________________________________________
activation_12 (Activation)       (None, 28, 28, 128)   0                                            
____________________________________________________________________________________________________
res3a_branch2c (Conv2D)          (None, 28, 28, 512)   66048                                        
____________________________________________________________________________________________________
res3a_branch1 (Conv2D)           (None, 28, 28, 512)   131584                                       
____________________________________________________________________________________________________
bn3a_branch2c (BatchNormalizatio (None, 28, 28, 512)   2048                                         
____________________________________________________________________________________________________
bn3a_branch1 (BatchNormalization (None, 28, 28, 512)   2048                                         
____________________________________________________________________________________________________
add_4 (Add)                      (None, 28, 28, 512)   0                                            
____________________________________________________________________________________________________
activation_13 (Activation)       (None, 28, 28, 512)   0                                            
____________________________________________________________________________________________________
res3b_branch2a (Conv2D)          (None, 28, 28, 128)   65664                                        
____________________________________________________________________________________________________
bn3b_branch2a (BatchNormalizatio (None, 28, 28, 128)   512                                          
____________________________________________________________________________________________________
activation_14 (Activation)       (None, 28, 28, 128)   0                                            
____________________________________________________________________________________________________
res3b_branch2b (Conv2D)          (None, 28, 28, 128)   147584                                       
____________________________________________________________________________________________________
bn3b_branch2b (BatchNormalizatio (None, 28, 28, 128)   512                                          
____________________________________________________________________________________________________
activation_15 (Activation)       (None, 28, 28, 128)   0                                            
____________________________________________________________________________________________________
res3b_branch2c (Conv2D)          (None, 28, 28, 512)   66048                                        
____________________________________________________________________________________________________
bn3b_branch2c (BatchNormalizatio (None, 28, 28, 512)   2048                                         
____________________________________________________________________________________________________
add_5 (Add)                      (None, 28, 28, 512)   0                                            
____________________________________________________________________________________________________
activation_16 (Activation)       (None, 28, 28, 512)   0                                            
____________________________________________________________________________________________________
res3c_branch2a (Conv2D)          (None, 28, 28, 128)   65664                                        
____________________________________________________________________________________________________
bn3c_branch2a (BatchNormalizatio (None, 28, 28, 128)   512                                          
____________________________________________________________________________________________________
activation_17 (Activation)       (None, 28, 28, 128)   0                                            
____________________________________________________________________________________________________
res3c_branch2b (Conv2D)          (None, 28, 28, 128)   147584                                       
____________________________________________________________________________________________________
bn3c_branch2b (BatchNormalizatio (None, 28, 28, 128)   512                                          
____________________________________________________________________________________________________
activation_18 (Activation)       (None, 28, 28, 128)   0                                            
____________________________________________________________________________________________________
res3c_branch2c (Conv2D)          (None, 28, 28, 512)   66048                                        
____________________________________________________________________________________________________
bn3c_branch2c (BatchNormalizatio (None, 28, 28, 512)   2048                                         
____________________________________________________________________________________________________
add_6 (Add)                      (None, 28, 28, 512)   0                                            
____________________________________________________________________________________________________
activation_19 (Activation)       (None, 28, 28, 512)   0                                            
____________________________________________________________________________________________________
res3d_branch2a (Conv2D)          (None, 28, 28, 128)   65664                                        
____________________________________________________________________________________________________
bn3d_branch2a (BatchNormalizatio (None, 28, 28, 128)   512                                          
____________________________________________________________________________________________________
activation_20 (Activation)       (None, 28, 28, 128)   0                                            
____________________________________________________________________________________________________
res3d_branch2b (Conv2D)          (None, 28, 28, 128)   147584                                       
____________________________________________________________________________________________________
bn3d_branch2b (BatchNormalizatio (None, 28, 28, 128)   512                                          
____________________________________________________________________________________________________
activation_21 (Activation)       (None, 28, 28, 128)   0                                            
____________________________________________________________________________________________________
res3d_branch2c (Conv2D)          (None, 28, 28, 512)   66048                                        
____________________________________________________________________________________________________
bn3d_branch2c (BatchNormalizatio (None, 28, 28, 512)   2048                                         
____________________________________________________________________________________________________
add_7 (Add)                      (None, 28, 28, 512)   0                                            
____________________________________________________________________________________________________
activation_22 (Activation)       (None, 28, 28, 512)   0                                            
____________________________________________________________________________________________________
res4a_branch2a (Conv2D)          (None, 14, 14, 256)   131328                                       
____________________________________________________________________________________________________
bn4a_branch2a (BatchNormalizatio (None, 14, 14, 256)   1024                                         
____________________________________________________________________________________________________
activation_23 (Activation)       (None, 14, 14, 256)   0                                            
____________________________________________________________________________________________________
res4a_branch2b (Conv2D)          (None, 14, 14, 256)   590080                                       
____________________________________________________________________________________________________
bn4a_branch2b (BatchNormalizatio (None, 14, 14, 256)   1024                                         
____________________________________________________________________________________________________
activation_24 (Activation)       (None, 14, 14, 256)   0                                            
____________________________________________________________________________________________________
res4a_branch2c (Conv2D)          (None, 14, 14, 1024)  263168                                       
____________________________________________________________________________________________________
res4a_branch1 (Conv2D)           (None, 14, 14, 1024)  525312                                       
____________________________________________________________________________________________________
bn4a_branch2c (BatchNormalizatio (None, 14, 14, 1024)  4096                                         
____________________________________________________________________________________________________
bn4a_branch1 (BatchNormalization (None, 14, 14, 1024)  4096                                         
____________________________________________________________________________________________________
add_8 (Add)                      (None, 14, 14, 1024)  0                                            
____________________________________________________________________________________________________
activation_25 (Activation)       (None, 14, 14, 1024)  0                                            
____________________________________________________________________________________________________
res4b_branch2a (Conv2D)          (None, 14, 14, 256)   262400                                       
____________________________________________________________________________________________________
bn4b_branch2a (BatchNormalizatio (None, 14, 14, 256)   1024                                         
____________________________________________________________________________________________________
activation_26 (Activation)       (None, 14, 14, 256)   0                                            
____________________________________________________________________________________________________
res4b_branch2b (Conv2D)          (None, 14, 14, 256)   590080                                       
____________________________________________________________________________________________________
bn4b_branch2b (BatchNormalizatio (None, 14, 14, 256)   1024                                         
____________________________________________________________________________________________________
activation_27 (Activation)       (None, 14, 14, 256)   0                                            
____________________________________________________________________________________________________
res4b_branch2c (Conv2D)          (None, 14, 14, 1024)  263168                                       
____________________________________________________________________________________________________
bn4b_branch2c (BatchNormalizatio (None, 14, 14, 1024)  4096                                         
____________________________________________________________________________________________________
add_9 (Add)                      (None, 14, 14, 1024)  0                                            
____________________________________________________________________________________________________
activation_28 (Activation)       (None, 14, 14, 1024)  0                                            
____________________________________________________________________________________________________
res4c_branch2a (Conv2D)          (None, 14, 14, 256)   262400                                       
____________________________________________________________________________________________________
bn4c_branch2a (BatchNormalizatio (None, 14, 14, 256)   1024                                         
____________________________________________________________________________________________________
activation_29 (Activation)       (None, 14, 14, 256)   0                                            
____________________________________________________________________________________________________
res4c_branch2b (Conv2D)          (None, 14, 14, 256)   590080                                       
____________________________________________________________________________________________________
bn4c_branch2b (BatchNormalizatio (None, 14, 14, 256)   1024                                         
____________________________________________________________________________________________________
activation_30 (Activation)       (None, 14, 14, 256)   0                                            
____________________________________________________________________________________________________
res4c_branch2c (Conv2D)          (None, 14, 14, 1024)  263168                                       
____________________________________________________________________________________________________
bn4c_branch2c (BatchNormalizatio (None, 14, 14, 1024)  4096                                         
____________________________________________________________________________________________________
add_10 (Add)                     (None, 14, 14, 1024)  0                                            
____________________________________________________________________________________________________
activation_31 (Activation)       (None, 14, 14, 1024)  0                                            
____________________________________________________________________________________________________
res4d_branch2a (Conv2D)          (None, 14, 14, 256)   262400                                       
____________________________________________________________________________________________________
bn4d_branch2a (BatchNormalizatio (None, 14, 14, 256)   1024                                         
____________________________________________________________________________________________________
activation_32 (Activation)       (None, 14, 14, 256)   0                                            
____________________________________________________________________________________________________
res4d_branch2b (Conv2D)          (None, 14, 14, 256)   590080                                       
____________________________________________________________________________________________________
bn4d_branch2b (BatchNormalizatio (None, 14, 14, 256)   1024                                         
____________________________________________________________________________________________________
activation_33 (Activation)       (None, 14, 14, 256)   0                                            
____________________________________________________________________________________________________
res4d_branch2c (Conv2D)          (None, 14, 14, 1024)  263168                                       
____________________________________________________________________________________________________
bn4d_branch2c (BatchNormalizatio (None, 14, 14, 1024)  4096                                         
____________________________________________________________________________________________________
add_11 (Add)                     (None, 14, 14, 1024)  0                                            
____________________________________________________________________________________________________
activation_34 (Activation)       (None, 14, 14, 1024)  0                                            
____________________________________________________________________________________________________
res4e_branch2a (Conv2D)          (None, 14, 14, 256)   262400                                       
____________________________________________________________________________________________________
bn4e_branch2a (BatchNormalizatio (None, 14, 14, 256)   1024                                         
____________________________________________________________________________________________________
activation_35 (Activation)       (None, 14, 14, 256)   0                                            
____________________________________________________________________________________________________
res4e_branch2b (Conv2D)          (None, 14, 14, 256)   590080                                       
____________________________________________________________________________________________________
bn4e_branch2b (BatchNormalizatio (None, 14, 14, 256)   1024                                         
____________________________________________________________________________________________________
activation_36 (Activation)       (None, 14, 14, 256)   0                                            
____________________________________________________________________________________________________
res4e_branch2c (Conv2D)          (None, 14, 14, 1024)  263168                                       
____________________________________________________________________________________________________
bn4e_branch2c (BatchNormalizatio (None, 14, 14, 1024)  4096                                         
____________________________________________________________________________________________________
add_12 (Add)                     (None, 14, 14, 1024)  0                                            
____________________________________________________________________________________________________
activation_37 (Activation)       (None, 14, 14, 1024)  0                                            
____________________________________________________________________________________________________
res4f_branch2a (Conv2D)          (None, 14, 14, 256)   262400                                       
____________________________________________________________________________________________________
bn4f_branch2a (BatchNormalizatio (None, 14, 14, 256)   1024                                         
____________________________________________________________________________________________________
activation_38 (Activation)       (None, 14, 14, 256)   0                                            
____________________________________________________________________________________________________
res4f_branch2b (Conv2D)          (None, 14, 14, 256)   590080                                       
____________________________________________________________________________________________________
bn4f_branch2b (BatchNormalizatio (None, 14, 14, 256)   1024                                         
____________________________________________________________________________________________________
activation_39 (Activation)       (None, 14, 14, 256)   0                                            
____________________________________________________________________________________________________
res4f_branch2c (Conv2D)          (None, 14, 14, 1024)  263168                                       
____________________________________________________________________________________________________
bn4f_branch2c (BatchNormalizatio (None, 14, 14, 1024)  4096                                         
____________________________________________________________________________________________________
add_13 (Add)                     (None, 14, 14, 1024)  0                                            
____________________________________________________________________________________________________
activation_40 (Activation)       (None, 14, 14, 1024)  0                                            
____________________________________________________________________________________________________
res5a_branch2a (Conv2D)          (None, 7, 7, 512)     524800                                       
____________________________________________________________________________________________________
bn5a_branch2a (BatchNormalizatio (None, 7, 7, 512)     2048                                         
____________________________________________________________________________________________________
activation_41 (Activation)       (None, 7, 7, 512)     0                                            
____________________________________________________________________________________________________
res5a_branch2b (Conv2D)          (None, 7, 7, 512)     2359808                                      
____________________________________________________________________________________________________
bn5a_branch2b (BatchNormalizatio (None, 7, 7, 512)     2048                                         
____________________________________________________________________________________________________
activation_42 (Activation)       (None, 7, 7, 512)     0                                            
____________________________________________________________________________________________________
res5a_branch2c (Conv2D)          (None, 7, 7, 2048)    1050624                                      
____________________________________________________________________________________________________
res5a_branch1 (Conv2D)           (None, 7, 7, 2048)    2099200                                      
____________________________________________________________________________________________________
bn5a_branch2c (BatchNormalizatio (None, 7, 7, 2048)    8192                                         
____________________________________________________________________________________________________
bn5a_branch1 (BatchNormalization (None, 7, 7, 2048)    8192                                         
____________________________________________________________________________________________________
add_14 (Add)                     (None, 7, 7, 2048)    0                                            
____________________________________________________________________________________________________
activation_43 (Activation)       (None, 7, 7, 2048)    0                                            
____________________________________________________________________________________________________
res5b_branch2a (Conv2D)          (None, 7, 7, 512)     1049088                                      
____________________________________________________________________________________________________
bn5b_branch2a (BatchNormalizatio (None, 7, 7, 512)     2048                                         
____________________________________________________________________________________________________
activation_44 (Activation)       (None, 7, 7, 512)     0                                            
____________________________________________________________________________________________________
res5b_branch2b (Conv2D)          (None, 7, 7, 512)     2359808                                      
____________________________________________________________________________________________________
bn5b_branch2b (BatchNormalizatio (None, 7, 7, 512)     2048                                         
____________________________________________________________________________________________________
activation_45 (Activation)       (None, 7, 7, 512)     0                                            
____________________________________________________________________________________________________
res5b_branch2c (Conv2D)          (None, 7, 7, 2048)    1050624                                      
____________________________________________________________________________________________________
bn5b_branch2c (BatchNormalizatio (None, 7, 7, 2048)    8192                                         
____________________________________________________________________________________________________
add_15 (Add)                     (None, 7, 7, 2048)    0                                            
____________________________________________________________________________________________________
activation_46 (Activation)       (None, 7, 7, 2048)    0                                            
____________________________________________________________________________________________________
res5c_branch2a (Conv2D)          (None, 7, 7, 512)     1049088                                      
____________________________________________________________________________________________________
bn5c_branch2a (BatchNormalizatio (None, 7, 7, 512)     2048                                         
____________________________________________________________________________________________________
activation_47 (Activation)       (None, 7, 7, 512)     0                                            
____________________________________________________________________________________________________
res5c_branch2b (Conv2D)          (None, 7, 7, 512)     2359808                                      
____________________________________________________________________________________________________
bn5c_branch2b (BatchNormalizatio (None, 7, 7, 512)     2048                                         
____________________________________________________________________________________________________
activation_48 (Activation)       (None, 7, 7, 512)     0                                            
____________________________________________________________________________________________________
res5c_branch2c (Conv2D)          (None, 7, 7, 2048)    1050624                                      
____________________________________________________________________________________________________
bn5c_branch2c (BatchNormalizatio (None, 7, 7, 2048)    8192                                         
____________________________________________________________________________________________________
add_16 (Add)                     (None, 7, 7, 2048)    0                                            
____________________________________________________________________________________________________
activation_49 (Activation)       (None, 7, 7, 2048)    0                                            
____________________________________________________________________________________________________
avg_pool (AveragePooling2D)      (None, 1, 1, 2048)    0                                            
____________________________________________________________________________________________________
flatten_1 (Flatten)              (None, 2048)          0                                            
____________________________________________________________________________________________________
fc1000 (Dense)                   (None, 1000)          2049000                                      
====================================================================================================
Total params: 25,636,712
Trainable params: 25,583,592
Non-trainable params: 53,120
____________________________________________________________________________________________________
None